import json
import openai

client = openai.OpenAI(
    api_key = "haixin_tech948hna96dhYUs6208",
    base_url = "http://localhost:6306/v1",
)

content = {}
ls = [{"words_result":[{"words":"姓名：周安华"},{"words":"住院号：1048834"},{"words":"第1页"},{"words":"姓名:周安华 性别:男 年龄:63岁"},{"words":"出生年月：1961年09月15日"},{"words":"国籍：中国 费别：上海市 民族：汉族"},{"words":"婚否：已婚"},{"words":"工作单位：无"},{"words":"职业：退休"},{"words":"住址：上海市普陀区延长西路40弄18号207室"},{"words":"邮政编码：200000"},{"words":"入院时间：2025-08-18 09:58 记录时间：2025-08-18 13:36 发病节气：立秋后"},{"words":"提供者：本人及其家属"},{"words":"可靠程度：可靠 与患者关系：其他 联系电话：15021621601"},{"words":"主治医师第一次查房诊断：中医（证型）：肺癌、精气虚衰证"},{"words":"TNM分期：是，T2,N2,M0,IIb期。"},{"words":"西医：肺恶性肿瘤 原发性中央型左肺上叶小细胞癌 c-T2bN2bM0 IIIB期"},{"words":"胃恶性肿瘤 原发性胃癌 T1cN0M1(肝？、肾上？)"},{"words":"化疗后肿瘤抑制"},{"words":"2型糖尿病"},{"words":"高血压病3级（极高危）"},{"words":"脑萎缩"},{"words":"胆囊结石"},{"words":"慢性胰腺炎"},{"words":"胆囊腺肌症"},{"words":"单纯性肾囊肿"},{"words":"诊断日期：2025-08-18"},{"words":"主治医师签名：杨鹤"},{"words":"主诉 确诊左肺癌1年余，乏力1周。"},{"words":"现病史 患者自2024年06月08日，出现咳嗽，同济医院检查：胸部增强CT示：1、左肺上叶近肺门区及肺门区肺癌，最大截面范围约4.6*2.8cm, 伴左肺门区及纵隔内多发淋巴结转移，较大者约3.4*2.2cm, 局部侵犯肺动脉可能；左肺上叶阻塞性肺炎可能。2、右肺上叶局限性肺气肿。3、附见：左肾上腺腺瘤可能，直径约1.1cm。2024-06-12全麻下行支气管镜左上叶黏膜活检。液基细胞学检查：（淋巴结EBUS-TBNA)见异型细胞，倾向小细胞癌。病理：（纵隔淋巴结活检）分化差的腺癌伴神经内分泌分化，倾向小细胞癌。免疫组化：CKpan(部分+), TTF-1(+), CgA(+), Ki-67(+约40%), Syn(+), PSA(+/+). 于2024-07-02至2024-09-25起在我院行信迪利单抗免疫治疗+EP方案化疗4周期（信迪利单抗200mg ivgtt d1 + 依托泊苷100mg ivgtt d1-3 + 顺铂50mg ivgtt d1、顺铂40mg ivgtt d2-3, q3w)。2024-08-19龙华医院查胸部平扫CT: 两肺内散在支扩及慢性炎症；两下肺及右肺中叶多发实性结节，较大者位于左肺下叶背段(IM192), 大小约为7*4mm; 纵隔内多发淋巴结，较大者短径约9mm. 2024-10-17行第1周期信迪利单抗免疫治疗+E方案化疗(依托泊苷100mg ivgtt d1-3)。2024-11-18胃镜：胰头钩突部实性占位，EUS-FNA(转移瘤可能)，病理检查：..."},{"words":"总页数：7"},{"words":"显示比例：80%"}],"log_id":1965706763571621602,"words_result_num":62,"direction":0}
,{"words_result":[{"words":"小细胞肺癌。符合腺癌。免疫组化：A:TTF-1(-)、DPC4(-)、CDx2(阑区强+)、Syn(-)、CK19(+)、Trypsin(-"},{"words":")、CEA(+)、INSM1(-)、CK7(+)、AE1/AE3(+)、Ki-67(约5%+)、P53(野生型表达+)。2024-11-16、2024-"},{"words":"12-19、2025-01-17行信迪利单抗免疫治疗+IP方案化疗3程（信迪利单抗200mg ivgtt d1 + 伊立替康"},{"words":"100mg ivgtt d1,d8 + 顺铂50mg ivgtt d1,d8),因患者不能耐受，均暂停第8天化疗。2025-01-15"},{"words":"胸部CT平扫：两肺散在分布多发小结节，较2024-10-15片两肺下叶部分病灶略增大。两肺散在支气管、索条"},{"words":"影。右肺前胸膜下淡片影。2025-02-14行替吉奥治疗，具体方案：替吉奥胶囊60mg bid po, d1-28,"},{"words":"q6w。口服28日后患者因出现口腔溃疡剧痛无法忍受后停药。2025-02-17起行达伯舒免疫治疗*2，具体方"},{"words":"案：信迪利单抗注射液200mg ivgtt。末次时间：2025-03-13。2025-04-08龙华医院MRI报告：上腹部"},{"words":"增强MRI: 比较2025-01-15新增肝左外叶包膜下异常信号灶，长径约14mm, 左肾上腺结节，较大者大小约"},{"words":"22mm×18mm, 结合病史考虑转移瘤。建议患者行PET/CT明确病情变化后评估治疗方案，患者暂拒PET/CT检查，"},{"words":"邀请肿瘤七科协助诊疗，评估介入治疗指征。肿瘤七科会诊意见：可于局部属注治疗，患者表示暂缓，表示"},{"words":"行替吉奥治疗后1周期后再评估后续治疗方案，2025年4月11日继续行替吉奥+达伯舒免疫治疗，具体方"},{"words":"案：替吉奥胶囊早60mg 晚40mg 口服，d1-14 + 信迪利单抗200mg ivgtt d1 q3w。患者服用替吉奥后副反应"},{"words":"大，患者肿瘤标志物胃泌素释放肽前体106.00→pg/mL, 经科室讨论及主任同意，2025-5-8起行EP+特瑞普利"},{"words":"单抗治疗，具体方案：特瑞普利单抗240mg ivgtt d1 + 依托泊苷100mg ivgtt d1-3 + 顺铂40mg ivgtt"},{"words":"d1、顺铂30mg ivgtt d2-3, q3w。末次复查：2025-07-01 CT检查报告：胸部平扫两上肺结节较2025-4-8"},{"words":"片吸收。左肺上叶结节灶较前新发，余两肺结节较前相仿两肺散在支气管、索条影；附见肝左叶低密度灶，"},{"words":"左肾上腺增粗并结节，左肾低密度灶。2025-07-03 上腹部增强MRI: 左肾上腺占位，较2025-04-08增"},{"words":"大，结合病史考虑转移瘤。前片所示肝左外叶异常信号结节本次未见；后腹膜多发小淋巴结。2025-7-5起行"},{"words":"安罗替尼靶向治疗+特瑞普利单抗免疫治疗C1-C2。具体方案: 安罗替尼12mg + 特瑞普利单抗240mg ivgtt"},{"words":"d1。近1周患者自觉乏力，现为进一步治疗，故收入院。患者自本次发病以来，饮食正常，睡眠尚可，大便"},{"words":"如常，小便如常，体重未见明显下降。"},{"words":"是否初始治疗：否，病理为：小细胞肺癌。"},{"words":"是否放射治疗：否。"},{"words":"是否一线治疗：是。"},{"words":"是否二线治疗：否。"},{"words":"是否三线治疗：否。"},{"words":"是否四线治疗：否。"},{"words":"是否五线治疗：否。"},{"words":"是否新辅助治疗：是。"},{"words":"是否手术治疗：否"},{"words":"是否术后辅助治疗：是。"},{"words":"本次入院疗效评价:是。"},{"words":"疼痛评价:是。"}],"log_id":1965706697810859691,"words_result_num":72,"direction":0},{"words_result":[{"words":"刻下乏力，口苦口干，口干口苦，胃纳一般，大便干结，夜尿1-2次，夜寐尚安。"},{"words":"既往史"},{"words":"平素健康状况良好；患者既往否认高血压病史。否认知糖尿病病史。否认知冠心病病史。否认慢性支气管炎"},{"words":"病史。有胆结石病史。有胆囊炎病史。否认知传染病史。否认静脉曲张病史。预防接种史按规定。有手术外伤"},{"words":"史。2024-06-12全麻下行气管镜胃左上叶黏膜活检（详见现病史）。否认知输血史。"},{"words":"心脏病/心肌病是否放置冠脉支架:否"},{"words":"脑梗：否"},{"words":"病毒性肝炎：否"},{"words":"其他非肿瘤疾病：否"},{"words":"手术史：否。"},{"words":"腹部手术史：否。"},{"words":"头颈部手术史：否。"},{"words":"肿瘤病史：否。"},{"words":"过敏史无过敏。"},{"words":"个人史出生于上海市，生长于上海市。否认知吸烟史，否认知饮酒史。否认知药物瘾。否认知疫水疫区接触"},{"words":"史。无工业毒物、粉尘、放射性物质接触史。无冶游史。此次入院前7天内是否确认境外旅行史。"},{"words":"婚育史已婚，配偶：健康状况良好，已育，子女健康状况良好。"},{"words":"家族史父母配婚：非近亲；父：健在；母：健在；兄弟姐妹：无。家族中是否确认类似患者。否认可遗传"},{"words":"病史。"},{"words":"供史者签名上述基本信息，主诉及既往史内容真实，供史者签名："},{"words":"中医望、闻、切"},{"words":"望诊望神：有神，望色：荣华，望形：适中，正常的体型：身体各部外视均称、发育相称、五官端正"},{"words":", 病态的体型：无，望态：动作灵敏。"},{"words":"问诊听声声音：正常声音，音调和谐，发声异常：无语言异常：无，呼吸异常：时，咳嗽：无，呕恶："},{"words":"时，吸气：无，喜逆：时，嗳气病症体气味：时，排出物气味：未见，呕吐物：无自气或入水，小便：无"},{"words":"特异气味, 大便:无特殊气味, 痰气:无特殊气味, 带下;无特殊气味。"},{"words":"切诊皮肤:温, 皮肤湿润;四肢:温暖;胸部;虚里按之四动, 腹部:软热; 正常; 边压痛;无压"},{"words":"痛。辨腹满：无腹满；辨胀满：无胃胀；辨结胸：无结胸；脾块：无脾块；连串：无压痛；舌象：舌质："},{"words":"淡红，舌体运动：正常，舌苔：薄白，脉象：细。"},{"words":"体格检查"},{"words":"一般情况:T36.5℃ P80次/分 R18次/分 BP120/78mmHg"},{"words":"意识状态：清楚，精神状态：良好，形态：适中，发育：良好，营养：良好，语音语调：正常，面色："},{"words":"总页数：7"},{"words":"显示比例：80%"}],"log_id":1965706738213638064,"words_result_num":64,"direction":0},{"words_result":[{"words":"神志：清楚，步态：正常，体位：自主，面容表情：自然，检查：合作。MEWS评分1分"},{"words":"皮肤黏膜：黄染：无，瘀斑：无，弹性：良好，皮下出血：无，水肿：无。"},{"words":"浅表淋巴结：无肿大。"},{"words":"头部：头颅：正常大小，外形：正常。"},{"words":"眼：巩膜：无黄染，结膜：无水肿，眼球正常，角膜透明，虹膜正常，瞳孔：等圆、等大（直径2.5mm),"},{"words":"对光反射：存在。"},{"words":"耳：耳结：耳结正常，无外耳道分泌物，无乳突压痛，无听力粗试障碍。"},{"words":"口：口唇红润，口腔黏膜正常，无龈齿、舌苔，齿列整齐，舌居中，无口唇充血，双侧颊腺体无肿大。"},{"words":"颈部：颈软，无颈抵抗，气管居中，颈静脉无怒张，颈动脉搏动正常，颈动脉及锁骨下动脉无血管杂"},{"words":"音，双侧甲状腺无肿大。"},{"words":"胸部：胸廓正常，无隆起或凹陷，无胸骨压痛。"},{"words":"肺：双肺呼吸运动正常，肋间隙正常。语颤正常，无胸膜摩擦感。叩诊呈清音。双肺呼吸音清，未闻及"},{"words":"干湿啰音,无胸膜摩擦音。"},{"words":"心：心前区无隆起，心尖搏动正常，心尖搏动位置：第5肋间左锁骨中线内0.5cm处，无抬举感，无"},{"words":"震颤，相对浊音界无扩大，左锁骨中线距前正中线8cm, 心率80次/分，律齐，无心包摩擦音，各瓣膜听诊区"},{"words":"未闻及病理性杂音。"},{"words":"周围血管：未见异常"},{"words":"腹部：腹部平软，无腹直肌曲张，无胃肠型，无蠕动波，腹式呼吸存在，未见手术瘢痕。腹软，无压"},{"words":"痛，无反跳痛；无包块。肝脾肋下未触及，剑突下未触及。胆囊未触及。胰腺未触及，Murphy征阴性。肝浊"},{"words":"音界存在，肝上界位于右锁骨中线第5肋间，无肝区叩击痛，无肾区叩击痛，移动性浊音阴性。肠鸣音正常，"},{"words":"无血管杂音，无振水音。"},{"words":"肾门直肠及生殖器:生殖器正常,肾门直肠正常。"},{"words":"脊柱四肢：脊柱正常，活动度正常，无压痛。无棘突压痛，四肢正常，无肌肉压痛，无肌肉萎缩，无杵"},{"words":"状指（趾），双下肢无水肿。"},{"words":"神经系统：腹壁反射：存在，肌力：正常，肱二头肌反射：存在，膝腱反射：正常，跟腱反射：正"},{"words":"常。Hoffmann征：左(-)右(-)，Babinski征：左(-)右(-)，Chaddock征：左(-)右(-)，Gordon征：左(-)"},{"words":"右(-),Oppenheia征：左(-)右(-),Rernig征：左(-)右(-),肌张力：未见异常。"},{"words":"专科检查"},{"words":"双侧呼吸运动对称，呼吸节律及深浅正常，肋间隙正常，语颤正常，未闻及干湿啰音，无胸膜摩擦音，"},{"words":"无皮下捻发音，叩诊呈清音，双肺下界位于锁骨中线下第10肋间，双肺下界位于锁骨中线下第10肋间，呼吸移动度："},{"words":"右6cm,左6cm,呼吸规整，双肺呼吸音低，无啰音（无），语音传导正常，无摩擦音。心率80次/分，律齐，"},{"words":"无杂音，腹壁触软、紧张度适中，无压痛，无反跳痛；肝脾肋下未触及；胆囊未触及，肾静脉反流征阴"},{"words":"性。双下肢无水肿。"},{"words":"总页数：7"},{"words":"显示比例：80%"}],"log_id":1965706714179538211,"words_result_num":63,"direction":0},{"words_result":[{"words":"2024-05-26同济医院上腹部–CT增强：肝左外叶血管瘤，大小约1.6*1.1cm; 左肾囊肿，大小约2.8*2.4cm, 两肾周围少许渗出性改变；胆囊结石，胰底部局限性腺体增生可能；左肾上腺结节，直径约1.1cm, 考虑腺瘤可能。"},{"words":"2024-05-26同济医院盆腔CT增强：前列腺增生，腹主动脉及其分支动脉硬化。"},{"words":"2024-06-08同济医院肺CT增强：1、左肺上叶近肺门区及肺门区肺癌，最大截面范围约4.6*2.8cm, 伴左肺门区及纵隔内多发淋巴结转移，较大者约3.4*2.2cm, 局部侵犯肺动脉可能；左肺上叶阻塞性肺炎可能。2、右肺上叶局限性肺气肿。3、冠状动脉硬化。4、附见：胆囊炎，左肾囊肿，左肾上腺腺瘤可能，直径约1.1cm, 肝左外叶血管瘤。"},{"words":"2024-06-14同济医院胸水细胞学检查（CF2401497）:（左上叶支气管灌洗液BAL）: 见呼铁色素，未见癌细胞。"},{"words":"2024-06-17同济医院胸水细胞学检查（CF2401498）:（淋巴结EBUS-TBNA）见异型细胞，倾向小细胞癌。"},{"words":"2024-06-17同济医院病理诊断报告（CFP2412510）:（淋巴结活检）分化差的腺癌伴神经内分泌分化，倾向小细胞癌。免疫组化：CKpan（部分+），TTF-1(+)，CK5/6(-)，CgA(+)，Ki-67(+约40%)，Syn(+)，CD20(-)，CD3(-)，抗酸(-)，网染(-)。PSA(+/-)."},{"words":"2024-06-27龙华医院MRI检查报告：头部增强双侧基底节区、侧脑室及半卵圆中心腔梗灶；脑萎缩。"},{"words":"2024-07-01龙华医院ECT检查报告：全身骨显像未见明显转移征象。"},{"words":"2024-08-19龙华医院CT检查报告：胸部平扫两肺内散在支扩及慢性炎症；两下肺及右肺中叶多发实性结节，较大者位于左肺下叶背段(M192), 大小约为7*mm; 纵隔内多发淋巴结，较大者短径约9mm; 建议：对照老片、随访复查；扫及胆囊结石。"},{"words":"2024-10-16龙华医院胸部CT平扫：两肺内散在支扩及慢性炎症；两肺多发实性结节较20240819片相仿纵隔内淋巴结扫及胆囊结石。"},{"words":"2024-11-13龙华医院上腹部MRI增强：胰头钩突部信号不均，主胰管扩张，建议结合临床并定期随访。肝左外叶血管瘤；胆囊结石，胰底部结节，左肾小囊肿；左侧肾上腺结节、后腹膜多发小淋巴结。"},{"words":"2024-11-16龙华医院头部MRI平扫：两侧额顶叶，侧脑室外角及半卵圆中心缺血性腔梗灶；脑萎缩，两筛窦少许炎症。"},{"words":"2024-11-18龙华医院胃镜：胰头钩突部实性占位，EUS-FNA（转移瘤可能）胆囊结石；胰底部腺体增生；左肝内胆管扩张。"},{"words":"2024-11-22龙华医院胃镜病理：胰头钩突部实性占位，EUS-FNA样本（胰头钩突部实性占位，EUS-FNA样本）纤维组织内见大量游离腺上皮细胞团，小区域纤维组织内见少许上皮细胞巢，上皮细胞伴轻-中度异型，排列呈不规则腺管状或筛孔状，可疑神经侵犯，局灶纤维组织增生伴少许淋巴细胞浸润。结合HE形态，免疫标记结果：胃肠道腺癌细胞学PSC报告系统：VI类，恶性，符合腺癌，免疫组化：A:TTF-1(+)、Protein C4(+)、CDx2（局部弱-）、Syn(-)、CK19(-)、Trypsin(-)、CEA(+)、INSM.(-)、CKT-、AE1/AE3(-)、Ki-67(约5%-)、FS3野生型表达)"},{"words":"总页数：7"},{"words":"显示比例：80%"}],"log_id":1965706748278705633,"words_result_num":69,"direction":0},{"words_result":[{"words":"2025-01-15龙华医院上腹部增强MRI: 胰腺头部信号不均，主胰管扩张，较2024-11-13片大致相仿，"},{"words":"建议结合临床并定期随访；肝左叶包膜下血管瘤；胆囊结石，胆囊炎，胆囊底部腺瘤样增生，左肾囊肿；左肾上腺"},{"words":"结节，后腹膜多发小淋巴结。"},{"words":"2025-01-15胸部CT平扫：两肺散在分布多发小结节，较2024-10-15片两肺下叶部分病灶略增大，请复查。"},{"words":"两肺散在支气管、索条影。右肺前胸膜下淡片影，请复查。附见胆囊结石，左肾上腺增粗并结节，左肾低密度灶。"},{"words":"2025-04-08龙华医院上腹部增强MRI: 比较2025-01-15新增肝左外叶包膜下异常信号灶，长径约14mm, 左肾上腺"},{"words":"结节，较大者大小约22mm×18mm, 较前片增大，范围略增大，结合病史考虑转移瘤，结合临床，必要时"},{"words":"PETCT。肝左叶包膜下血管瘤可能；胆囊结石，胆囊炎，胆囊底部腺瘤样增生胰腺头部信号不均，主胰管扩"},{"words":"张；左肾囊性；后腹膜多发小淋巴结。"},{"words":"2025-04-08龙华医院胸部CT: 两肺散在分布多发小结节，7x5mm, 较2025-01-15片变化不大；两上肺结节较"},{"words":"前片新增；建议：抗炎后复查；两肺散在支气管、索条影；附见肝左叶低密度灶，左肾上腺增粗并结节，左"},{"words":"肾低密度灶。"},{"words":"2025-07-01 CT检查报告：胸部平扫两上肺结节较2025-4-8片吸收，左肺上叶结节灶较前新发，余两肺结"},{"words":"节较前相仿两肺散在支气管、索条影；附见肝左叶低密度灶，左肾上腺增粗并结节，左肾低密度灶。"},{"words":"2025-07-03 MRI检查报告：上腹部增强左肾上腺占位，较2025-04-08增大，结合病史考虑转移瘤，前片所"},{"words":"示肝左外叶异常信号结节本次未见，建议结合诊疗科，余肝左叶包膜下海绵状血管瘤；胆囊结石，慢性胆囊"},{"words":"炎，胆囊底部腺瘤样增生。胰腺头部信号不均，胰体尾轻度萎缩，主胰管扩张，左肾囊肿；后腹膜多发小淋巴结。"},{"words":"2025-07-04 MRI检查报告：头部增强两侧顶叶、侧脑室外角及半卵圆中心多发腔隙性脑梗；脑萎缩。附见；双"},{"words":"侧筛窦炎。"},{"words":"初步诊断"},{"words":"TNM分期：是，T2b,N2,M0,Ib期。"},{"words":"中医诊断：肺癌、精气虚衰证"},{"words":"西医诊断：肺癌晚期原发性中央型左肺上叶小细胞癌c-T2bN2bM0IIIB期"},{"words":"胃肠道恶性肿瘤原发性腺癌T1cNOMO IA期(肝？、肾上腺？)"},{"words":"化疗后骨髓抑制"},{"words":"2型糖尿病"},{"words":"高血压病3级（极高危）"},{"words":"脑后遗症"},{"words":"胆囊结石"},{"words":"慢性胆囊炎"},{"words":"胆囊底部腺瘤样增生"},{"words":"单纯性肾囊肿"},{"words":"总页数：7"},{"words":"显示比例：80%"}],"log_id":1965706850573243003,"words_result_num":72,"direction":0}]

prompt="""
    ###你是一个结构化提取机器人，能够把非结构化的文本转化为json。
    需要的key有这些：  
    1.入院时间
    2.记录时间
    3.入院方式
    4.主诉
    5.现病史
    6.既往史
    7.个人史
    8.月经史
    9.婚育史
    10.家族史
    11.体检检查
    12.专科检查
    13.辅助检查结果
    14.入院初步诊断
    由于页面信息不足，你每次都需要补充上一次的json结果,而不是覆盖，如果你需要给某字段添加内容，请保证添加内容和原始的连续性
    如果当前给你的内容出现了以上的字段，那么你应该就把其之后的的内容分配给这个key
    ###输出格式:
    ```json
    {
        "入院时间":,
        "记录时间":,
        "入院方式":,
        "主诉":,
        "现病史":,
        "既往史":,
        "个人史":,
        "月经史":,
        "婚育史":,
        "家族史":,
        "体检检查":,
        "专科检查":,
        "辅助检查结果":,
        "入院初步诊断":,
        "当前处理的字段:"以上之一"
    }
    ```
"""




menu_ls = ["入院时间","记录时间","入院方式", "主诉","现病史","既往史","个人史","月经史","婚育史","家族史","体检检查","专科检查","辅助检查结果","入园初步诊断"]




for idx,item in enumerate(ls):
    for result in item["words_result"]:
        for menu in menu_ls:
            if menu in result["words"]:
                result["words"] = result["words"].replace(menu, f"\n\n***{menu}***")
        content[idx] =content.get(idx,"") + result["words"]
        
accumulated_json = {}

for i in range(0, len(content.keys()),3):
    pages_in_batch = []
    
    # 添加前页上下文（如果有）
    if i >0:
        pages_in_batch.append(f"[前页上下文] {content[i-1][:150]}")
    
    # 添加当前批次的页面
    for j in range(i, min(i + 3, len(content))):
        pages_in_batch.append(f"[第{j+1}页] {content[j]}")
    
    # 合并所有页面内容
    current_content = "\n\n".join(pages_in_batch)
    
    print(f"\n=== 处理第 {i+1}-{min(i+3, len(content))} 页 (共{len(pages_in_batch)}页) ===")
    print(f"内容预览: {current_content}")
    messages = [{"role":"system","content":prompt}]
    
    if accumulated_json:
        messages.append({
            "role": "assistant", 
            "content": f"当前已提取的JSON内容：\n{json.dumps(accumulated_json, ensure_ascii=False, indent=2)}"
        })
    
    user_message = {
        "role": "user", 
        "content": f"请基于以下新内容补充和更新JSON：\n\n{current_content}"
    }
    messages.append(user_message)
    
    try:
        response = client.chat.completions.create(
            model="Qwen3-32B",
            messages=messages,
            temperature=0.1,
            max_tokens=6000
        )
        
        ai_response = response.choices[0].message.content
        print(f"AI响应: {ai_response[:200]}...")
        
        try:
            if "```json" in ai_response:
                json_start = ai_response.find("```json") + 7
                json_end = ai_response.find("```", json_start)
                json_str = ai_response[json_start:json_end].strip()
            else:
                json_str = ai_response.strip()
            
            new_json = json.loads(json_str)
            
            for key, value in new_json.items():
                if value and value.strip(): 
                    accumulated_json[key] = value
            
            print(accumulated_json)
            print(f"成功更新JSON，当前字段数: {len(accumulated_json)}")
            
        except json.JSONDecodeError as e:
            print(f"JSON解析错误: {e}")
            print(f"AI原始响应: {ai_response}")
                
    except Exception as e:
        print(f"请求失败: {e}")
        continue
    print("-" * 50)

print("\n=== 最终提取的JSON结果 ===")
final_json = json.dumps(accumulated_json, ensure_ascii=False, indent=2)
print(final_json)

# 保存到文件
with open("extracted_medical_record.json", "w", encoding="utf-8") as f:
    f.write(final_json)
print("\n结果已保存到 extracted_medical_record.json")
